Courses/7370/Lectures/Fundas/concurrency-fundamentals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Concurrency Fundamentals</title>
<!-- 2016-08-30 Tue 19:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="WSU CEG 7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Concurrency Fundamentals</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Concurrency Problems</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Mutual Exclusion
</li>
<li>(Asynchronous) Message Passing
</li>
<li>Synchronization
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Concurrency Folk Theorems</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Folk Theorem: Given any one mechanism for the above, the others cannot be built
</li>
<li>Folk Theorem: Given any two of the above, the third can be built.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Elementary Constructs</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <a href="./semicolon-par-fat-bars.html">./semicolon-par-fat-bars.html</a></h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Semantics of Semicolon ;
</li>
<li>Semantics of Parallel Bar ||
</li>
<li>Semantics of Fat Bar []
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <code>&lt;&gt;</code> statements</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Angular-brackets: The enclosed statements are performed
<i>atomically</i>.
</li>

<li>Defining the semantics of "atomic" is a goal of this course.
</li>
<li>For now: No interleaving of other processes/ threads.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <code>&lt;await&gt;</code> statements</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><code>&lt;await B =&gt; S&gt;</code> B is a side-effect-free Boolean expression.  S is
a code segment.  
</li>

<li>Semantics, first cut: 
<ol class="org-ol">
<li>{Wait until B is true.  Execute S.  Atomically.  Once.} 
</li>
</ol>
</li>
<li>Semantics, more to come.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <a href="../Semaphores/semaphores.html">Semaphores</a></h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>An Abstract Data Type with two methods: P and V.
<ol class="org-ol">
<li>Some literature uses "wait" instead of P, and "signal" instead
of V.
</li>
<li>Uses await-statements.
</li>
</ol>
</li>
<li><a href="../Semaphores/semaphores.html">Semaphores</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Send + Recv Primitives</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>In process Q: <code>P ! msg</code> to process P send message msg
</li>
<li>In process P: <code>Q ? v</code> from process Q receive a message and store it in v
</li>
<li>The send from Q and the recv by P appear as a single event to an
external observer.
</li>
<li>No "buffering".
</li>
<li><b>The</b> primitives of <i>distributed computing</i>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Shared Tuple Space</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>A <i>tuple</i> is an ordered sequence of values, not necessarily of the
same type.

<ol class="org-ol">
<li>Ex: ("hello", true, 0.123, 50)
</li>
</ol>
</li>

<li>T, a shared tuple space, a <i>bag</i> of tuples. Collection possibly
with dupes.  For now, assume just one T.
</li>
<li>read from a shared tuple space T: read("hello", ?bl, ?rn, ?in);
item read remains in T.
</li>
<li>input("hello", ?bl, ?rn, ?in); T loses the item input.  Atomically.
</li>
<li>write into a shared tuple space T: output("there", 44); T gains the
item written.  Atomically.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Distributed Computing Architectures</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="../DC/client-server.html">../DC/client-server.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 
</div>
</body>
</html>
